pschatzmann/ESP32-A2DP/src/BluetoothA2DPSource.cpp
      // if (param->pin_req.min_16_digit) {
      //   ESP_LOGI(BT_AV_TAG, "Input pin code: 0000 0000 0000 0000");
      //   esp_bt_pin_code_t pin_code = {0};
      //   esp_bt_gap_pin_reply(param->pin_req.bda, true, 16, pin_code);
      // } else {
      //   ESP_LOGI(BT_AV_TAG, "Input pin code: 1234");
      //   esp_bt_gap_pin_reply(param->pin_req.bda, true, pin_code_len,
      //   pin_code);
      // }
      break;
    }

    /* when Security Simple Pairing passkey notified, this event comes */
    case ESP_BT_GAP_KEY_NOTIF_EVT:
      if (!ssp_enabled) break;
      ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_KEY_NOTIF_EVT passkey:%d",
               param->key_notif.passkey);
      break;
    /* when Security Simple Pairing passkey requested, this event comes */
    case ESP_BT_GAP_KEY_REQ_EVT:
      if (!ssp_enabled) break;
      ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_KEY_REQ_EVT Please enter passkey!");
      break;

    /* when Security Simple Pairing user confirmation requested, this event
     * comes
     */
    case ESP_BT_GAP_CFM_REQ_EVT:
      ESP_LOGI(
          BT_AV_TAG,
          "ESP_BT_GAP_CFM_REQ_EVT Please compare the numeric value: %" PRIu32,
          param->cfm_req.num_val);
      esp_bt_gap_ssp_confirm_reply(param->cfm_req.bda, true);
      break;

#if ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(4, 4, 4)
    case ESP_BT_GAP_ACL_CONN_CMPL_STAT_EVT:
      ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_ACL_CONN_CMPL_STAT_EVT");
      break;

    case ESP_BT_GAP_ACL_DISCONN_CMPL_STAT_EVT:
      ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_ACL_DISCONN_CMPL_STAT_EVT");
      connection_state = ESP_A2D_CONNECTION_STATE_DISCONNECTED;
      if (connection_state_callback != nullptr) {
        connection_state_callback(connection_state, connection_state_obj);
      }
      break;

    case ESP_BT_GAP_MODE_CHG_EVT:
      ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_MODE_CHG_EVT mode:%d",
               param->mode_chg.mode);
      break;

#endif

#if ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(5, 3, 2)
    case ESP_BT_GAP_GET_DEV_NAME_CMPL_EVT:
      if (param->get_dev_name_cmpl.status == ESP_BT_STATUS_SUCCESS) {
        ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_GET_DEV_NAME_CMPL_EVT device name: %s",
                 param->get_dev_name_cmpl.name);
      } else {
        ESP_LOGI(BT_AV_TAG,
                 "ESP_BT_GAP_GET_DEV_NAME_CMPL_EVT failed, state: %d",
                 param->get_dev_name_cmpl.status);
      }
      break;

    case ESP_BT_GAP_ENC_CHG_EVT:
      ESP_LOGI(BT_AV_TAG, "ESP_BT_GAP_ENC_CHG_EVT");
      break;
#endif

    default: {
      ESP_LOGI(BT_AV_TAG, "event: %d", event);
      break;
    }
  }
  return;
}

void BluetoothA2DPSource::av_hdl_stack_evt(uint16_t event, void *p_param) {
  ESP_LOGD(BT_AV_TAG, "%s event: %d", __func__, event);

  switch (event) {
    /* when stack up worked, this event comes */
    case BT_APP_EVT_STACK_UP: {
      // set up device name
      esp_bt_gap_set_device_name(dev_name);

      // register GAP callback function
      esp_bt_gap_register_callback(ccall_app_gap_callback);

      // initialize AVRCP controller
      esp_avrc_ct_init();
      esp_avrc_ct_register_callback(ccall_app_rc_ct_callback);

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
      /* initialize AVRCP target */
      if (is_passthru_active) {
        esp_avrc_tg_init();
        esp_avrc_tg_register_callback(ccall_app_rc_tg_callback);
      }

      // add request to ESP_AVRC_RN_VOLUME_CHANGE
      esp_avrc_rn_evt_cap_mask_t evt_set = {0};
      for (auto event : avrc_rn_events) {
        esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_SET, &evt_set,
                                           event);
      }
      if (esp_avrc_tg_set_rn_evt_cap(&evt_set) != ESP_OK) {
        ESP_LOGE(BT_AV_TAG, "esp_avrc_tg_set_rn_evt_cap failed");
      }
#endif

      esp_a2d_source_init();
      esp_a2d_register_callback(&ccall_app_a2d_callback);
      esp_a2d_source_register_data_callback(&ccall_bt_app_a2d_data_cb);

      /* Avoid the state error of s_a2d_state caused by the connection initiated
       * by the peer device. */
      // esp_bt_gap_set_scan_mode(ESP_BT_NON_CONNECTABLE,
      // ESP_BT_NON_DISCOVERABLE);
      delay_ms(10000);
      set_scan_mode_connectable(false);

      if (reconnect_status == AutoReconnect && has_last_connection()) {
        ESP_LOGW(BT_AV_TAG, "Reconnecting to %s", to_str(last_connection));
        memcpy(peer_bd_addr, last_connection, ESP_BD_ADDR_LEN);
        connect_to(last_connection);
        s_a2d_state = APP_AV_STATE_CONNECTING;
      } else {
        ESP_LOGI(BT_AV_TAG, "Starting device discovery...");
        s_a2d_state = APP_AV_STATE_DISCOVERING;
        esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, 10, 0);
      }
      // create and start heart beat timer
      int tmr_id = 0;
      s_tmr = xTimerCreate("connTmr", (10000 / portTICK_PERIOD_MS), pdTRUE,
                           (void *)&tmr_id, ccall_a2d_app_heart_beat);
      xTimerStart(s_tmr, portMAX_DELAY);
      break;
    }
    /* other */
    default: {
      ESP_LOGW(BT_AV_TAG, "%s unhandled event: %d", __func__, event);
      break;
    }
  }
}

void BluetoothA2DPSource::app_a2d_callback(esp_a2d_cb_event_t event,
                                        esp_a2d_cb_param_t *param) {
  bt_app_work_dispatch(ccall_bt_app_av_sm_hdlr, event, param,
                       sizeof(esp_a2d_cb_param_t), nullptr);
}

void BluetoothA2DPSource::a2d_app_heart_beat(void *arg) {
  bt_app_work_dispatch(ccall_bt_app_av_sm_hdlr, BT_APP_HEART_BEAT_EVT, nullptr, 0,
                       nullptr);
}

void BluetoothA2DPSource::process_user_state_callbacks(uint16_t event,
                                                       void *param) {
  ESP_LOGD(BT_AV_TAG, "%s", __func__);

  esp_a2d_cb_param_t *a2d = nullptr;

  // callbacks
  switch (event) {
    case ESP_A2D_CONNECTION_STATE_EVT:
      a2d = (esp_a2d_cb_param_t *)(param);
      ESP_LOGD(BT_AV_TAG, "%s ESP_A2D_CONNECTION_STATE_EVT: %s", __func__,
               to_str(a2d->conn_stat.state));

      // callback on state change
      connection_state = a2d->conn_stat.state;
      if (connection_state_callback != nullptr) {
        connection_state_callback(a2d->conn_stat.state, connection_state_obj);
      }

      // reset reconnect status on successful connection
      if (connection_state == ESP_A2D_CONNECTION_STATE_CONNECTED) {
        reconnect_retries = max_reconnect_retries;
      }
      break;

    case ESP_A2D_AUDIO_STATE_EVT:
      a2d = (esp_a2d_cb_param_t *)(param);
      ESP_LOGD(BT_AV_TAG, "%s ESP_A2D_AUDIO_STATE_EVT: %s", __func__,
               to_str(a2d->audio_stat.state));

      // callback on state change
      if (audio_state_callback != nullptr) {
        audio_state_callback(a2d->audio_stat.state, audio_state_obj);
        audio_state = a2d->audio_stat.state;
      }
      break;
  }
}

